Testing/prototypes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Prototypes: Brief Thoughts</title>
<!-- 2016-02-01 Mon 21:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Prototypes: Brief Thoughts</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">The Problem</a></li>
<li><a href="#sec-3">The Solution</a>
<ul>
<li><a href="#sec-3-1">Reduce the scope of the prototype</a></li>
<li><a href="#sec-3-2">Select Technology Appropriately</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
How many times as a developer have I heard the line "It started out
as a prototype/ proof of concept, but ended up being used as the
product" ? I think it's happened in most companies I have worked in
to a greater or lesser extent.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">The Problem</h2>
<div class="outline-text-2" id="text-2">
<p>
So firstly I thought I'd ask the question: "Why does a prototype /
proof of concept become a full product?"
</p>

<p>
My answer would be summarised as follows:
</p>

<ul class="org-ul">
<li>We have too large a scope for the prototype.
</li>
<li>The prototype is developed using the production technology.
</li>
<li>Expectations are incorrectly managed.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">The Solution</h2>
<div class="outline-text-2" id="text-3">
<p>
Ok, so maybe 'Solution' is a bit of a sweeping word to use, however
for the purposes of this short post it will have to do :)
</p>

<p>
Really this is just a collection of thoughts on addressing the
problems:
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Reduce the scope of the prototype</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A prototype / proof of concept is in its very nature intended to
answer a question. The more general this question becomes, the
broader the scope of the prototype. The scope can soon become the
scope of the whole product or product feature and then it becomes
very easy for business to expect it to be used as the real product.
</p>

<p>
Focussing the scope to answer the specific question at hand not
only reduces the effort and meets the need of the prototype but
also sets expectations for the prototype in such a way that it is
less likely to become the product or product feature.
</p>

<p>
For example, if there is a specific activity / path you want some
questions answered on it is unnecessary to include any features
outside that activity.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Select Technology Appropriately</h3>
<div class="outline-text-3" id="text-3-2">
<p>
By using the technology to be used in the product, the prototype
becomes easier to assimilate into the product. Again, examine the
question to be answered, what is the most appropriate technology,
given the skill set available, for answering that question in the
quickest simplest way.
</p>

<p>
Another point would be that with a prototype the developer has the
opportunity to develop it in a new language or with new technology
as an opportunity to not only learn a new technology, but to view
the problem from an unexpected angle, perhaps forcing them to think
through the problem in more detail.
</p>

<p>
Also, by choosing a technology that is not used in the product
itself, the prototype cannot just be copied across to the full
product.
</p>

<p>
I hope my thoughts are of help. They are by no means comprehensive
and comments would be very much appreciated, particularly other
people's experience of successful prototypes.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-01 Mon 21:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
